user_case = int(input("Some number:"))

days_dict = {
    0: "днів",
    1: "день",
    2: "дня",
    3: "дні",
    4: "дні",
    5: "днів",
    6: "днів",
    7: "днів",
    8: "днів",
    9: "днів",
    10: "днів",
    11: "днів",
    12: "днів",
    13: "днів",
    14: "днів",
    15: "днів",
    16: "днів",
    17: "днів",
    18: "днів",
    19: "днів",
    20: "днів",
    21: "день",
    22: "дня",
    23: "дні",
    24: "дні",
    25: "днів",
    26: "днів",
    27: "днів",
    28: "днів",
    29: "днів",
    30: "днів",
    31: "день",
    32: "дня",
    33: "дні",
    34: "дні",
    35: "днів",
    36: "днів",
    37: "днів",
    38: "днів",
    39: "днів",
    40: "днів",
    41: "день",
    42: "дня",
    43: "дні",
    44: "дні",
    45: "днів",
    46: "днів",
    47: "днів",
    48: "днів",
    49: "днів",
    50: "днів",
    51: "день",
    52: "дня",
    53: "дні",
    54: "дні",
    55: "днів",
    56: "днів",
    57: "днів",
    58: "днів",
    59: "днів",
    60: "днів",
    61: "день",
    62: "дня",
    63: "дні",
    64: "дні",
    65: "днів",
    66: "днів",
    67: "днів",
    68: "днів",
    69: "днів",
    70: "днів",
    71: "день",
    72: "дня",
    73: "дні",
    74: "дні",
    75: "днів",
    76: "днів",
    77: "днів",
    78: "днів",
    79: "днів",
    80: "днів",
    81: "день",
    82: "дня",
    83: "дні",
    84: "дні",
    85: "днів",
    86: "днів",
    87: "днів",
    88: "днів",
    89: "днів",
    90: "днів",
    91: "день",
    92: "дня",
    93: "дні",
    94: "дні",
    95: "днів",
    96: "днів",
    97: "днів",
    98: "днів",
    99: "днів",
}

if user_case >= 8640000 or user_case < 0:
    print("Invalid number")

days = user_case//86400
hours = (user_case//3600)-(days*24)
minutes = (user_case//60)-(hours*60)-(days*1440)
seconds = user_case-(minutes*60)-(hours*3600)-(days*86400)


hours, minutes, seconds = str(hours), str(minutes), str(seconds)

value = days_dict[days]

if len(hours) < 2:
    hours = hours.zfill(2)

if len(minutes) < 2:
    minutes = minutes.zfill(2)

if len(seconds) < 2:
    seconds = seconds.zfill(2)

print(days, value, ",", hours, ":", minutes, ":", seconds)
